bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G0C1.svd
        </registers>
    </peripheral>	
	<peripheral>
      <name>DMAMUX</name>
      <description>DMAMUX</description>
      <groupName>DMAMUX</groupName>
      <baseAddress>0x40020800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMAMUX_C0CR</name>
          <displayName>DMAMUX_C0CR</displayName>
          <description>DMAMUX request line multiplexer channel x configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			  <field>
				<name>DMAREQ_ID</name>
				<description>DMA request identification
	Selects the input DMA request. See the DMAMUX table about assignments of multiplexer inputs to resources.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>6</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SOIE</name>
				<description>Synchronization overrun interrupt enable</description>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>interrupt disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>interrupt enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>EGE</name>
				<description>Event generation enable</description>
				<bitOffset>9</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>event generation disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>event generation enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SE</name>
				<description>Synchronization enable</description>
				<bitOffset>16</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>synchronization disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>synchronization enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SPOL</name>
				<description>Synchronization polarity
	Defines the edge polarity of the selected synchronization input:</description>
				<bitOffset>17</bitOffset>
				<bitWidth>2</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>no event, i.e. no synchronization nor detection.</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>rising edge</description>
					<value>0x1</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x2</name>
					<description>falling edge</description>
					<value>0x2</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x3</name>
					<description>rising and falling edge</description>
					<value>0x3</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>NBREQ</name>
				<description>Number of DMA requests minus 1 to forward
	Defines the number of DMA requests to forward to the DMA controller after a synchronization event, and/or the number of DMA requests before an output event is generated.
	This field shall only be written when both SE and EGE bits are low.</description>
				<bitOffset>19</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SYNC_ID</name>
				<description>Synchronization identification
	Selects the synchronization input (see inputs to resources STM32G0).</description>
				<bitOffset>24</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
          </fields>
        </register>
        <register>
          <name>DMAMUX_C1CR</name>
          <displayName>DMAMUX_C1CR</displayName>
          <description>DMAMUX request line multiplexer channel x configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
		      <field>
				<name>DMAREQ_ID</name>
				<description>DMA request identification
	Selects the input DMA request. See the DMAMUX table about assignments of multiplexer inputs to resources.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>6</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SOIE</name>
				<description>Synchronization overrun interrupt enable</description>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>interrupt disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>interrupt enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>EGE</name>
				<description>Event generation enable</description>
				<bitOffset>9</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>event generation disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>event generation enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SE</name>
				<description>Synchronization enable</description>
				<bitOffset>16</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>synchronization disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>synchronization enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SPOL</name>
				<description>Synchronization polarity
	Defines the edge polarity of the selected synchronization input:</description>
				<bitOffset>17</bitOffset>
				<bitWidth>2</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>no event, i.e. no synchronization nor detection.</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>rising edge</description>
					<value>0x1</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x2</name>
					<description>falling edge</description>
					<value>0x2</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x3</name>
					<description>rising and falling edge</description>
					<value>0x3</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>NBREQ</name>
				<description>Number of DMA requests minus 1 to forward
	Defines the number of DMA requests to forward to the DMA controller after a synchronization event, and/or the number of DMA requests before an output event is generated.
	This field shall only be written when both SE and EGE bits are low.</description>
				<bitOffset>19</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SYNC_ID</name>
				<description>Synchronization identification
	Selects the synchronization input (see inputs to resources STM32G0).</description>
				<bitOffset>24</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
          </fields>
        </register>
        <register>
          <name>DMAMUX_C2CR</name>
          <displayName>DMAMUX_C2CR</displayName>
          <description>DMAMUX request line multiplexer channel x configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			  <field>
				<name>DMAREQ_ID</name>
				<description>DMA request identification
	Selects the input DMA request. See the DMAMUX table about assignments of multiplexer inputs to resources.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>6</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SOIE</name>
				<description>Synchronization overrun interrupt enable</description>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>interrupt disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>interrupt enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>EGE</name>
				<description>Event generation enable</description>
				<bitOffset>9</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>event generation disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>event generation enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SE</name>
				<description>Synchronization enable</description>
				<bitOffset>16</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>synchronization disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>synchronization enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SPOL</name>
				<description>Synchronization polarity
	Defines the edge polarity of the selected synchronization input:</description>
				<bitOffset>17</bitOffset>
				<bitWidth>2</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>no event, i.e. no synchronization nor detection.</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>rising edge</description>
					<value>0x1</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x2</name>
					<description>falling edge</description>
					<value>0x2</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x3</name>
					<description>rising and falling edge</description>
					<value>0x3</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>NBREQ</name>
				<description>Number of DMA requests minus 1 to forward
	Defines the number of DMA requests to forward to the DMA controller after a synchronization event, and/or the number of DMA requests before an output event is generated.
	This field shall only be written when both SE and EGE bits are low.</description>
				<bitOffset>19</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SYNC_ID</name>
				<description>Synchronization identification
	Selects the synchronization input (see inputs to resources STM32G0).</description>
				<bitOffset>24</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
          </fields>
        </register>
        <register>
          <name>DMAMUX_C3CR</name>
          <displayName>DMAMUX_C3CR</displayName>
          <description>DMAMUX request line multiplexer channel x configuration register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
	         <field>
				<name>DMAREQ_ID</name>
				<description>DMA request identification
	Selects the input DMA request. See the DMAMUX table about assignments of multiplexer inputs to resources.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>6</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SOIE</name>
				<description>Synchronization overrun interrupt enable</description>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>interrupt disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>interrupt enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>EGE</name>
				<description>Event generation enable</description>
				<bitOffset>9</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>event generation disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>event generation enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SE</name>
				<description>Synchronization enable</description>
				<bitOffset>16</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>synchronization disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>synchronization enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SPOL</name>
				<description>Synchronization polarity
	Defines the edge polarity of the selected synchronization input:</description>
				<bitOffset>17</bitOffset>
				<bitWidth>2</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>no event, i.e. no synchronization nor detection.</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>rising edge</description>
					<value>0x1</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x2</name>
					<description>falling edge</description>
					<value>0x2</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x3</name>
					<description>rising and falling edge</description>
					<value>0x3</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>NBREQ</name>
				<description>Number of DMA requests minus 1 to forward
	Defines the number of DMA requests to forward to the DMA controller after a synchronization event, and/or the number of DMA requests before an output event is generated.
	This field shall only be written when both SE and EGE bits are low.</description>
				<bitOffset>19</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SYNC_ID</name>
				<description>Synchronization identification
	Selects the synchronization input (see inputs to resources STM32G0).</description>
				<bitOffset>24</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>  
		  </fields>
        </register>
        <register>
          <name>DMAMUX_C4CR</name>
          <displayName>DMAMUX_C4CR</displayName>
          <description>DMAMUX request line multiplexer channel x configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			  <field>
				<name>DMAREQ_ID</name>
				<description>DMA request identification
	Selects the input DMA request. See the DMAMUX table about assignments of multiplexer inputs to resources.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>6</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SOIE</name>
				<description>Synchronization overrun interrupt enable</description>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>interrupt disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>interrupt enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>EGE</name>
				<description>Event generation enable</description>
				<bitOffset>9</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>event generation disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>event generation enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SE</name>
				<description>Synchronization enable</description>
				<bitOffset>16</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>synchronization disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>synchronization enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SPOL</name>
				<description>Synchronization polarity
	Defines the edge polarity of the selected synchronization input:</description>
				<bitOffset>17</bitOffset>
				<bitWidth>2</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>no event, i.e. no synchronization nor detection.</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>rising edge</description>
					<value>0x1</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x2</name>
					<description>falling edge</description>
					<value>0x2</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x3</name>
					<description>rising and falling edge</description>
					<value>0x3</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>NBREQ</name>
				<description>Number of DMA requests minus 1 to forward
	Defines the number of DMA requests to forward to the DMA controller after a synchronization event, and/or the number of DMA requests before an output event is generated.
	This field shall only be written when both SE and EGE bits are low.</description>
				<bitOffset>19</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SYNC_ID</name>
				<description>Synchronization identification
	Selects the synchronization input (see inputs to resources STM32G0).</description>
				<bitOffset>24</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
          </fields>
        </register>
