bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G0C1.svd
        <register>
          <name>PCROP1BSR</name>
          <displayName>PCROP1BSR</displayName>
          <description>Flash PCROP zone B Start address
          register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xF0000000</resetValue>
          <fields>
            <field>
              <name>PCROP1B_STRT</name>
              <description>PCROP1B area start offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCROP1BER</name>
          <displayName>PCROP1BER</displayName>
          <description>Flash PCROP area B End address
          register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xF0000000</resetValue>
          <fields>
            <field>
              <name>PCROP1B_END</name>
              <description>PCROP1B area end offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>PCROP2ASR</name>
          <displayName>PCROP2ASR</displayName>
          <description>Flash PCROP2 area A start address register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCROP2A_STRT</name>
              <description>PCROP2A area start offset, bank2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>PCROP2AER</name>
          <displayName>PCROP2AER</displayName>
          <description>Flash PCROP2 area A end address register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCROP2A_END</name>
              <description>PCROP2A area end offset, bank2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>WRP2AR</name>
          <displayName>WRP2AR</displayName>
          <description>Flash WRP2 area A address register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRP2A_STRT</name>
              <description>WRP area A start offset, Bank 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
			<field>
              <name>WRP2A_END</name>
              <description>WRP area A end offset, Bank 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>WRP2BR</name>
          <displayName>WRP2BR</displayName>
          <description>Flash WRP2 area B address register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRP2B_STRT</name>
              <description>WRP area B start offset, Bank 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
			<field>
              <name>WRP2B_END</name>
              <description>WRP area B end offset, Bank 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>PCROP2BSR</name>
          <displayName>PCROP2BSR</displayName>
          <description>FLASH PCROP2 area B start address register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCROP2B_STRT</name>
              <description>PCROP2B area start offset, Bank 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>PCROP2BER</name>
          <displayName>PCROP2BER</displayName>
          <description>FLASH PCROP2 area B end address register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCROP2B_END</name>
              <description>PCROP2B area end offset, Bank 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>		
        <register>
          <name>SECR</name>
          <displayName>SECR</displayName>
          <description>Flash Security register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xF0000000</resetValue>
          <fields>
            <field>
              <name>SEC_SIZE</name>
              <description>Securable memory area size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BOOT_LOCK</name>
              <description>used to force boot from user
              area</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>SEC_SIZE2</name>
              <description>Securable memory area size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
